scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
bool isSupervisorRole() {
    return String(deviceRole).equalsIgnoreCase("sentinel") || String(deviceRole).equalsIgnoreCase("supervisor");
}

void configureSupervisorTargets() {
    supervisorBackendProbe.name = "backend";
    supervisorBackendProbe.url = SUPERVISOR_BACKEND_URL;
    supervisorFrontendProbe.name = "frontend";
    supervisorFrontendProbe.url = SUPERVISOR_FRONTEND_URL;
}

String computeNodeCapabilityHash() {
    String hash;
    hash.reserve(160);
    hash += firmwareVersion;
    hash += '|';
    hash += deviceRole;
    hash += '|';
    hash += preferredTaskType;
    hash += '|';
    hash += firmwareTrack;
    hash += '|';
    hash += otaEnabled ? '1' : '0';
    hash += '|';
    hash += isSupervisorRole() ? '1' : '0';
    hash += '|';
    hash += ffsUp ? '1' : '0';
#ifdef ENABLE_PMACHINE
    hash += "|pmachine:1";
#else
    hash += "|pmachine:0";
#endif
    hash += '|';
    hash += nodeName;
    return hash;
}

#if defined(ENABLE_DOORBELL_CAMERA)
void emitDoorbellAlert(const char* eventType, const MotionEvent* motionEvent = nullptr) {
    JsonDocument doc;
    doc["kind"] = "doorbellAlert";
    doc["eventType"] = eventType;
    doc["nodeName"] = nodeName;
    doc["deviceRole"] = deviceRole;
    doc["cameraIp"] = WiFi.localIP().toString();
    doc["snapshotUrl"] = String("http://") + WiFi.localIP().toString() + "/api/camera/capture";
    doc["timestamp"] = millis();
    if (motionEvent) {
        doc["changedBlocks"] = motionEvent->changedBlocks;
        doc["changePercentage"] = motionEvent->changePercentage;
        if (motionEvent->snapshotPath.length() > 0) {
            doc["snapshotPath"] = motionEvent->snapshotPath;
        }
    }

    String payload;
    serializeJson(doc, payload);

    if (globalBrokerClient) {
        globalBrokerClient->broadcastMessage("alerts", payload.c_str());
    }

    const uint16_t alertPort = udpRuntimeGetBoundParentPort();
    if (alertPort > 0) {
        WiFiUDP& udp = udpRuntimeSocket();
        udp.beginPacket(IPAddress(255, 255, 255, 255), alertPort);
        udp.write((const uint8_t*)payload.c_str(), payload.length());
        udp.endPacket();
    }

    Serial.printf("[DOORBELL] Alert emitted: %s\n", eventType);
}

void onDoorbellMotionDetected(const MotionEvent& event) {
    emitDoorbellAlert("person", &event);
}

void pollDoorbellButton() {
    const bool readingPressed = digitalRead(DOORBELL_BUTTON_PIN) == DOORBELL_BUTTON_ACTIVE_LEVEL;
    const unsigned long now = millis();

    if (readingPressed != doorbellButtonLastReading) {
        doorbellButtonLastReading = readingPressed;
        doorbellButtonLastChangeMs = now;
    }

    if ((now - doorbellButtonLastChangeMs) < DOORBELL_BUTTON_DEBOUNCE_MS) {
        return;
    }

    if (readingPressed != doorbellButtonStablePressed) {
        doorbellButtonStablePressed = readingPressed;
        if (doorbellButtonStablePressed) {
            emitDoorbellAlert("doorbell");
        }
    }
}
#endif

#if defined(ENABLE_DOORBELL_DISPLAY)
bool fetchUrlToBuffer(const String& url, uint8_t** buffer, size_t* length) {
    if (!buffer || !length) {
        return false;
    }

    *buffer = nullptr;
    *length = 0;

    HTTPClient http;
#if defined(ARDUINO_ARCH_ESP8266)
    WiFiClient client;
    if (!http.begin(client, url)) {
#else
    if (!http.begin(url)) {
#endif
        return false;
    }

    http.setTimeout(5000);
    const int code = http.GET();
    if (code != HTTP_CODE_OK) {
        http.end();
        return false;
    }

    const int totalLength = http.getSize();
    if (totalLength <= 0) {
        http.end();
        return false;
    }

    uint8_t* data = static_cast<uint8_t*>(malloc(static_cast<size_t>(totalLength)));
    if (!data) {
        http.end();
        return false;
    }

    WiFiClient* stream = http.getStreamPtr();
    size_t offset = 0;
    while (http.connected() && offset < static_cast<size_t>(totalLength)) {
        const size_t available = stream->available();
        if (available == 0) {
            delay(1);
            continue;
        }

        const size_t toRead = min(available, static_cast<size_t>(totalLength) - offset);
        const size_t readCount = stream->readBytes(reinterpret_cast<char*>(data + offset), toRead);
        offset += readCount;
    }

    http.end();

    if (offset != static_cast<size_t>(totalLength)) {
        free(data);
        return false;
    }

    *buffer = data;
    *length = offset;
    return true;
}

void handleDoorbellAlertPacket(const String& payload, IPAddress sourceIp, uint16_t sourcePort) {
    JsonDocument doc;
    if (deserializeJson(doc, payload)) {
        Serial.println("[DOORBELL] Ignoring malformed alert payload");
        return;
    }

    const String eventType = String(doc["eventType"] | doc["kind"] | "person");
    const String snapshotUrl = String(doc["snapshotUrl"] | "");

    doorbellLastAlertType = eventType;
    doorbellLastSnapshotUrl = snapshotUrl;
    doorbellLastAlertMs = millis();

    Serial.printf("[DOORBELL] Alert received from %s:%u type=%s\n", sourceIp.toString().c_str(), sourcePort, eventType.c_str());

    if (!displayService.isInitialized()) {
        return;
    }

    if (snapshotUrl.length() == 0) {
        displayService.showInfo("Doorbell alert received");
        return;
    }

    uint8_t* jpegBuffer = nullptr;
    size_t jpegLength = 0;
    if (!fetchUrlToBuffer(snapshotUrl, &jpegBuffer, &jpegLength)) {
        displayService.showError("Failed to fetch camera JPEG");
        return;
    }

    const bool shown = displayService.showJpeg(jpegBuffer, jpegLength, 0, 0);
    free(jpegBuffer);

    if (!shown) {
        displayService.showError("Failed to render camera JPEG");
    }
}
#endif

void updateProbeResult(SupervisorProbeState& probe, bool healthy, int statusCode, const String& errorText) {
    probe.healthy = healthy;
    probe.lastStatusCode = statusCode;
    probe.lastCheckMs = millis();
    probe.lastError = errorText;
    if (healthy) probe.okCount++;
    else probe.failCount++;
}

void probeHttpTarget(SupervisorProbeState& probe) {
    if (probe.url.length() == 0) {
        updateProbeResult(probe, false, -1, "probe url not configured");
        return;
    }

