scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
void setupOtaService() {
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("[OTA] WiFi not connected; OTA disabled");
        otaEnabled = false;
        return;
    }

    ArduinoOTA.setHostname(nodeName.c_str());
    ArduinoOTA.onStart([]() {
        Serial.println("[OTA] Update started");
    });
    ArduinoOTA.onEnd([]() {
        Serial.println("[OTA] Update complete");
    });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        if (total == 0) return;
        unsigned int pct = (progress * 100U) / total;
        Serial.printf("[OTA] Progress: %u%%\n", pct);
    });
    ArduinoOTA.onError([](ota_error_t error) {
        Serial.printf("[OTA] Error[%u]\n", static_cast<unsigned int>(error));
    });

    ArduinoOTA.begin();
    otaEnabled = true;
    Serial.print("[OTA] Ready. Hostname=");
    Serial.print(nodeName);
    Serial.print(" IP=");
    Serial.println(WiFi.localIP());
    Serial.print("[OTA] Firmware version=");
    Serial.println(firmwareVersion);
}

// ...existing code...

void setupWebServer() {
            // Service broker endpoint: aggregator can notify this node when a service is assigned or released
            server.on("/service-broker/announce", HTTP_POST, [](AsyncWebServerRequest *request){
                if (!request->hasParam("service", true) || !request->hasParam("busy", true)) {
                    request->send(400, "text/plain", "Missing service or busy param");
                    return;
                }
                String service = request->getParam("service", true)->value();
                bool busy = request->getParam("busy", true)->value() == "true";
                serviceBusyMap[service] = busy;
                request->send(200, "text/plain", String(service) + " set to " + (busy ? "busy" : "free"));
            });

    // Board source-of-truth node naming endpoint.
    server.on("/node/name", HTTP_POST, [](AsyncWebServerRequest *request){
        String nextName;
        if (request->hasParam("nodeName", true)) {
            nextName = request->getParam("nodeName", true)->value();
        } else if (request->hasParam("nodeName")) {
            nextName = request->getParam("nodeName")->value();
        }

        nextName.trim();
        if (nextName.length() == 0) {
            request->send(400, "application/json", "{\"error\":\"nodeName is required\"}");
            return;
        }

        nodeName = nextName;
        File f = LittleFS.open(NODE_NAME_PATH, "w");
        if (!f) {
            request->send(500, "application/json", "{\"error\":\"failed to persist nodeName file\"}");
            return;
        }
        f.print(nodeName);
        f.close();

        if (!loadNodeConfig(nodeConfig)) {
            nodeConfig = NodeConfig();
        }
        nodeConfig.nodeName = nodeName;
        saveNodeConfig(nodeConfig);

#if defined(ESP32)
        WiFi.setHostname(nodeName.c_str());
#elif defined(ESP8266)
        WiFi.hostname(nodeName.c_str());
#endif

        bonecrusherConfig.workerId = nodeName;
        udpRuntimeResetBeaconState();
        announcePresence();

        JsonDocument doc;
        doc["status"] = "ok";
        doc["nodeName"] = nodeName;
        doc["persisted"] = true;
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    // Board source-of-truth topology endpoint.
    server.on("/node/topology", HTTP_POST, [](AsyncWebServerRequest *request){
        if (!loadNodeConfig(nodeConfig)) {
            nodeConfig = NodeConfig();
        }

        if (request->hasParam("activeClusterId", true)) {
            nodeConfig.activeClusterId = request->getParam("activeClusterId", true)->value();
        }
        if (request->hasParam("parentHost", true)) {
            nodeConfig.parentHost = request->getParam("parentHost", true)->value();
        }
        if (request->hasParam("parentNodeId", true)) {
            nodeConfig.parentNodeId = request->getParam("parentNodeId", true)->value();
        }
        if (request->hasParam("isClusterGateway", true)) {
            nodeConfig.isClusterGateway = parseBoolValue(request->getParam("isClusterGateway", true)->value());
        }
        if (request->hasParam("parentPort", true)) {
            const int v = request->getParam("parentPort", true)->value().toInt();
            if (v >= 1024 && v <= 65535) nodeConfig.parentPort = static_cast<uint16_t>(v);
        }
        if (request->hasParam("siblingPort", true)) {
            const int v = request->getParam("siblingPort", true)->value().toInt();
            if (v >= 1024 && v <= 65535) nodeConfig.siblingPort = static_cast<uint16_t>(v);
        }

        saveNodeConfig(nodeConfig);

        runtimeUdpParentPort = nodeConfig.parentPort;
        runtimeUdpSiblingPort = nodeConfig.siblingPort;
        udpRuntimeEnsureReady(runtimeUdpParentPort, runtimeUdpSiblingPort);
        udpRuntimeResetBeaconState();
        announcePresence();

        JsonDocument doc;
        doc["status"] = "ok";
        auto cluster = doc["cluster"].to<JsonObject>();
        cluster["activeClusterId"] = nodeConfig.activeClusterId;
        cluster["parentHost"] = nodeConfig.parentHost;
        cluster["parentNodeId"] = nodeConfig.parentNodeId;
        cluster["isClusterGateway"] = nodeConfig.isClusterGateway;
        cluster["parentPort"] = nodeConfig.parentPort;
        cluster["siblingPort"] = nodeConfig.siblingPort;
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    server.on("/node/restart", HTTP_POST, [](AsyncWebServerRequest *request){
        String reason = "api-request";
        if (request->hasParam("reason", true)) {
            reason = request->getParam("reason", true)->value();
        } else if (request->hasParam("reason")) {
            reason = request->getParam("reason")->value();
        }

        int delayMs = 150;
        if (request->hasParam("delayMs", true)) {
            delayMs = request->getParam("delayMs", true)->value().toInt();
        } else if (request->hasParam("delayMs")) {
            delayMs = request->getParam("delayMs")->value().toInt();
        }
        if (delayMs < 0) delayMs = 0;
        if (delayMs > 2000) delayMs = 2000;

        JsonDocument doc;
        doc["status"] = "ok";
        doc["restartRequested"] = true;
        doc["reason"] = reason;
        doc["delayMs"] = delayMs;
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);

        delay(delayMs);
        ESP.restart();
    });

    // Relay device actions: toggle, turnOn, turnOff.
    server.on("/devices/relay/action", HTTP_POST, [](AsyncWebServerRequest *request){
        String action;
        if (request->hasParam("action", true)) {
            action = request->getParam("action", true)->value();
        } else if (request->hasParam("action")) {
            action = request->getParam("action")->value();
        }
        action.trim();
        if (action.length() == 0) {
            request->send(400, "application/json", "{\"error\":\"action is required\"}");
            return;
        }

        pinMode(relayPinNumber, OUTPUT);
        if (action.equalsIgnoreCase("toggle")) {
            relayStateOn = !relayStateOn;
        } else if (action.equalsIgnoreCase("turnOn")) {
            relayStateOn = true;
        } else if (action.equalsIgnoreCase("turnOff")) {
            relayStateOn = false;
        } else {
            request->send(400, "application/json", "{\"error\":\"unsupported relay action\"}");
            return;
        }

        digitalWrite(relayPinNumber, relayStateOn ? HIGH : LOW);

        JsonDocument doc;
        doc["status"] = "ok";
        doc["device"] = "RELAY";
        doc["action"] = action;
        doc["pin"] = relayPinNumber;
        doc["state"] = relayStateOn ? "on" : "off";
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });
    // Self-describing services endpoint
    server.on("/services/describe", HTTP_GET, [](AsyncWebServerRequest *request){
        JsonDocument doc;
        #if defined(ESP32)
        doc["hardware"] = "ESP32";
        #elif defined(ESP8266)
        doc["hardware"] = "ESP8266";
        #else
        doc["hardware"] = "Unknown";
        #endif
        doc["nodeName"] = nodeName;
        doc["firmwareVersion"] = firmwareVersion;
        doc["deviceRole"] = deviceRole;
        doc["preferredTaskType"] = preferredTaskType;
        doc["firmwareTrack"] = firmwareTrack;
        doc["otaEnabled"] = otaEnabled;
        doc["maxMessageBytes"] = static_cast<uint32_t>(maxMessageBytes);
        doc["maxConcurrentTasks"] = static_cast<uint32_t>(maxConcurrentTasks);
        auto cluster = doc["cluster"].to<JsonObject>();
        cluster["activeClusterId"] = nodeConfig.activeClusterId;
        cluster["parentHost"] = nodeConfig.parentHost;
        cluster["parentNodeId"] = nodeConfig.parentNodeId;
        cluster["isClusterGateway"] = nodeConfig.isClusterGateway;
        cluster["parentPort"] = nodeConfig.parentPort;
        cluster["siblingPort"] = nodeConfig.siblingPort;
        auto services = doc["services"].to<JsonArray>();

        if (isSupervisorRole()) {
            auto supervisor = services.add<JsonObject>();
            supervisor["name"] = "StartupSupervisor";
            supervisor["description"] = "Monitors backend/frontend readiness and exposes stability telemetry.";
            supervisor["status"] = supervisorOverallHealthy() ? "healthy" : "degraded";
            auto supervisorCmds = supervisor["commands"].to<JsonArray>();
            JsonObject c1 = supervisorCmds.add<JsonObject>();
            c1["name"] = "status";
            c1["description"] = "GET /supervisor/status returns health telemetry.";
            JsonObject c2 = supervisorCmds.add<JsonObject>();
            c2["name"] = "configure";
            c2["description"] = "POST /supervisor/config to update enabled flag, interval, and probe URLs.";
        }

        // Devices section: enumerate devices and their documentation/visibility
        JsonArray devices = doc["devices"].to<JsonArray>();
        if (LittleFS.exists("/devices")) {
            File dir = LittleFS.open("/devices", "r");
            File entry = dir.openNextFile();
            while (entry) {
                if (entry.isDirectory()) {
                    entry = dir.openNextFile();
                    continue;
                }
                String devName = String(entry.name());
                if (devName.startsWith("/devices/")) devName = devName.substring(9);
                if (!devName.endsWith(".json")) {
                    entry.close();
                    entry = dir.openNextFile();
                    continue;
                }
                if (devName.endsWith(".json")) devName = devName.substring(0, devName.length() - 5);
                // Read device JSON
                String devJsonStr = entry.readString();
                entry.close();
                JsonDocument devDoc;
                DeserializationError err = deserializeJson(devDoc, devJsonStr);
                JsonObject devObj = devices.add<JsonObject>();
                devObj["name"] = devName;
                // Visibility: default private, can be set to public in device JSON
                String visibility = "private";
                if (!err && devDoc["visibility"].is<const char*>()) {
                    visibility = devDoc["visibility"].as<String>();
                }
                devObj["visibility"] = visibility;
                // Load documentation from FFS if available
                String docText;
                String docPath = String("/devices/docs/") + devName + ".txt";
                File docFile = LittleFS.open(docPath, "r");
                if (docFile) {
                    docText = docFile.readString();
                    docFile.close();
                } else {
                    docText = String("Device: ") + devName;
                }
                devObj["description"] = docText;
                // Optionally, add device actions/commands if present in JSON
                if (!err && devDoc["actions"].is<JsonArray>()) {
                    JsonArray actions = devObj["actions"].to<JsonArray>();
                    for (JsonVariant v : devDoc["actions"].as<JsonArray>()) {
                        String actionName = v.as<String>();
                        String actionDocPath = String("/devices/docs/") + devName + "_" + actionName + ".txt";
                        String actionDoc;
                        File actionDocFile = LittleFS.open(actionDocPath, "r");
                        if (actionDocFile) { actionDoc = actionDocFile.readString(); actionDocFile.close(); }
                        else { actionDoc = String("Action: ") + actionName; }
                        JsonObject act = actions.add<JsonObject>();
                        act["name"] = actionName;
                        act["description"] = actionDoc;
                    }
                }
                entry = dir.openNextFile();
            }
        }

        // FFS Service
        auto ffs = services.add<JsonObject>();
        ffs["name"] = "FFS";
        {
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs.txt", "r");
            if (docFile) {
                docText = docFile.readString();
                docFile.close();
            } else {
                docText = "Federated File System: provides distributed file storage and access.";
            }
            ffs["description"] = docText;
        }
        // Check if broker has marked this service busy
        extern std::map<String, bool> serviceBusyMap;
        String ffsStatus = ffsUp ? "up" : "down";
        if (serviceBusyMap.count("FFS") && serviceBusyMap["FFS"]) ffsStatus = "busy";
        ffs["status"] = ffsStatus;
        auto ffsCmds = ffs["commands"].to<JsonArray>();
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "listFiles";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_listFiles.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "List all files in the file system."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "write";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_write.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Write data to a file."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "read";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_read.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Read data from a file."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "remove";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_remove.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Remove a file from the file system."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "sync";
            String docText;
            File docFile = LittleFS.open("/services/docs/ffs_sync.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Synchronize file system to storage."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "mount";
            cmd["description"] = "Create a mount point that aliases a local path or points at a peer node.";
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "unmount";
            cmd["description"] = "Remove a previously configured mount point.";
        }
        {
            JsonObject cmd = ffsCmds.add<JsonObject>();
            cmd["name"] = "mounts";
            cmd["description"] = "List configured mount points.";
        }

