scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
        // Sensor Service (example, static)
        auto sensor = services.add<JsonObject>();
        sensor["name"] = "SensorService";
        {
            String docText;
            File docFile = LittleFS.open("/services/docs/sensor.txt", "r");
            if (docFile) {
                docText = docFile.readString();
                docFile.close();
            } else {
                docText = "Provides access to connected sensors (e.g., DHT22, BME280).";
            }
            sensor["description"] = docText;
        }
        String sensorStatus = "ready";
        if (serviceBusyMap.count("SensorService") && serviceBusyMap["SensorService"]) sensorStatus = "busy";
        sensor["status"] = sensorStatus;
        auto sensorCmds = sensor["commands"].to<JsonArray>();
        {
            JsonObject cmd = sensorCmds.add<JsonObject>();
            cmd["name"] = "readSensor";
            String docText;
            File docFile = LittleFS.open("/services/docs/sensor_readSensor.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Read values from a sensor."; }
            cmd["description"] = docText;
        }
        {
            JsonObject cmd = sensorCmds.add<JsonObject>();
            cmd["name"] = "resultToJson";
            String docText;
            File docFile = LittleFS.open("/services/docs/sensor_resultToJson.txt", "r");
            if (docFile) { docText = docFile.readString(); docFile.close(); }
            else { docText = "Convert sensor result to JSON."; }
            cmd["description"] = docText;
        }

        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

    // GET /sensor/read?pin=4&type=DHT22&unit=C
    server.on("/status", HTTP_GET, [](AsyncWebServerRequest *request){
        const uint32_t freeHeap = ESP.getFreeHeap();
        if (freeHeap < 70000) {
            char fallback[256];
            snprintf(
                fallback,
                sizeof(fallback),
                "{\"status\":\"degraded\",\"error\":\"low_heap\",\"freeHeap\":%lu,\"nodeName\":\"%s\",\"ip\":\"%s\"}",
                static_cast<unsigned long>(freeHeap),
                nodeName.c_str(),
                WiFi.localIP().toString().c_str());
            request->send(200, "application/json", fallback);
            return;
        }

        const size_t maxDiscoveredNodesInStatus = 64;
        const size_t estimatedNodeBytes = 80;
        String json;
        const size_t reserveBytes = 2200 + (std::min(discoveredNodeTable.size(), maxDiscoveredNodesInStatus) * estimatedNodeBytes);
        if (!json.reserve(reserveBytes)) {
            char fallback[256];
            snprintf(
                fallback,
                sizeof(fallback),
                "{\"status\":\"degraded\",\"error\":\"reserve_failed\",\"freeHeap\":%lu,\"nodeName\":\"%s\",\"ip\":\"%s\"}",
                static_cast<unsigned long>(ESP.getFreeHeap()),
                nodeName.c_str(),
                WiFi.localIP().toString().c_str());
            request->send(200, "application/json", fallback);
            return;
        }

        json = "{";
        #if defined(ESP32)
            File dir = LittleFS.open("/devices", "r");
        #elif defined(ESP8266)
        json += "\"hardware\":\"ESP8266\",";
        #endif
        json += "\"nodeName\":\"" + nodeName + "\",";
        json += "\"firmwareVersion\":\"" + String(firmwareVersion) + "\",";
        json += "\"deviceRole\":\"" + String(deviceRole) + "\",";
        json += "\"preferredTaskType\":\"" + String(preferredTaskType) + "\",";
        json += "\"firmwareTrack\":\"" + String(firmwareTrack) + "\",";
        json += String("\"otaEnabled\":") + (otaEnabled ? "true" : "false") + ",";
        json += "\"maxMessageBytes\":" + String((unsigned long)maxMessageBytes) + ",";
        json += "\"maxConcurrentTasks\":" + String((unsigned long)maxConcurrentTasks) + ",";
        json += "\"cluster\":{";
        json += "\"activeClusterId\":\"" + String(nodeConfig.activeClusterId) + "\",";
        json += "\"parentHost\":\"" + String(nodeConfig.parentHost) + "\",";
        json += "\"parentNodeId\":\"" + String(nodeConfig.parentNodeId) + "\",";
        json += String("\"isClusterGateway\":") + (nodeConfig.isClusterGateway ? "true" : "false") + ",";
        json += "\"parentPort\":" + String((unsigned long)nodeConfig.parentPort) + ",";
        json += "\"siblingPort\":" + String((unsigned long)nodeConfig.siblingPort);
        json += "},";
        json += "\"beacon\":{";
        json += String("\"acknowledged\":") + (udpRuntimeIsBeaconAcknowledged() ? "true" : "false") + ",";
        json += "\"lastSentAt\":" + String((unsigned long)udpRuntimeGetBeaconLastSentAt()) + ",";
        json += "\"lastAckAt\":" + String((unsigned long)udpRuntimeGetBeaconLastAckAt()) + ",";
        json += "\"capabilityHash\":\"" + computeNodeCapabilityHash() + "\"}" + ",";
        if (isSupervisorRole()) {
            json += String("\"supervisorEnabled\":") + (supervisorEnabled ? "true" : "false") + ",";
            json += String("\"supervisorOverallHealthy\":") + (supervisorOverallHealthy() ? "true" : "false") + ",";
        }
        json += "\"services\":[";
        bool firstService = true;
        if (isSupervisorRole()) {
            json += "\"StartupSupervisor\"";
            firstService = false;
        }
        if (ffsUp) {
            if (!firstService) json += ",";
            json += "\"FFS\"";
            firstService = false;
        }
        #ifdef ENABLE_PMACHINE
        if (!firstService) json += ",";
        #ifndef DISABLE_PMACHINE_ROUTES
        json += "\"pmachine\"";
        json += ",\"GenericRouterService\"";
        firstService = false;
        #endif
        #endif
        #ifdef ENABLE_BLUETOOTH_DEVICES
        if (!firstService) json += ",";
        json += "\"BluetoothService\"";
        firstService = false;
        #if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
            if (!firstService) json += ",";
            json += "\"BluetoothAudioTtsService\"";
            firstService = false;
        #endif
        #endif
        #ifdef ENABLE_EVENT_SCHEDULER
        if (!firstService) json += ",";
        json += "\"EventSchedulerService\"";
        firstService = false;
        #endif
        json += "]";
        json += ",\"discoveredNodes\":[";
        bool first = true;
        size_t emittedNodes = 0;
        for (const auto& pair : discoveredNodeTable) {
            if (emittedNodes >= maxDiscoveredNodesInStatus) {
                break;
            }
            if (!first) json += ",";
            json += "{\"mac\":\"" + pair.second.mac + "\",\"ip\":\"" + pair.second.ip + "\"}";
            first = false;
            emittedNodes++;
        }
        json += "]";
        json += ",\"discoveredNodeCount\":" + String((unsigned long)discoveredNodeTable.size());
        json += ",\"discoveredNodesTruncated\":";
        json += (discoveredNodeTable.size() > emittedNodes) ? "true" : "false";
        json += "}";
        request->send(200, "application/json", json);
    });

    server.on("/supervisor/status", HTTP_GET, [](AsyncWebServerRequest *request){
        JsonDocument doc;
        doc["deviceRole"] = deviceRole;
        auto supervisor = doc["supervisor"].to<JsonObject>();
        appendSupervisorStatus(supervisor);
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });

