scobolguy/pulse-new-repo/virtualMachines/esp32/src/main.cpp
#ifdef ENABLE_AWS_IOT
    Serial.println("[BOOT] Initializing AWS IoT Gateway...");
    if (initializeAwsIotGateway()) {
        Serial.println("[AWS_IOT] AWS IoT Gateway initialized successfully");
    } else {
        Serial.println("[AWS_IOT] AWS IoT Gateway initialization failed");
    }
#endif

#ifdef ENABLE_DISPLAY
    Serial.println("[BOOT] Initializing display service...");
    if (displayService.begin()) {
        Serial.println("[DISPLAY] Display initialized successfully");
        
#ifndef DISPLAY_NO_LVGL
        // Initialize DDL Renderer
        Serial.println("[BOOT] Initializing DDL renderer...");
        if (ddlRenderer.begin(displayService.getLVGLDisplay())) {
            Serial.println("[DDL] DDL renderer initialized successfully");
            
            // Set up action callback
            ddlRenderer.setActionCallback([&](const String& action) {
                Serial.printf("[DDL] Action triggered: %s\n", action.c_str());
                // TODO: Handle actions (e.g., device.relay.toggle, system.refresh)
            });
            
            // Set up registry callback
            ddlRenderer.setRegistryCallback([&](const String& key, JsonVariant value) {
                Serial.printf("[DDL] Registry update from UI: %s = %s\n", key.c_str(), value.as<String>().c_str());
                // TODO: Update registry/pmachine state
            });
            
            // Load and render DDL
            if (LittleFS.exists("/display/example.ddl.json")) {
                Serial.println("[DDL] Loading example DDL...");
                if (ddlRenderer.loadDDL("/display/example.ddl.json")) {
                    ddlRenderer.render();
                    Serial.println("[DDL] DDL rendered successfully");
                } else {
                    Serial.println("[DDL] Failed to load DDL file");
                }
            } else {
                Serial.println("[DDL] No DDL file found, using embedded touch test DDL");
                
                // Embedded touch test DDL - compact single card design
                String touchTestDDL = R"({
                    "display": "TouchTest",
                    "version": "1.0",
                    "layout": {
                        "type": "column",
                        "cards": [
                            {
                                "id": "touchCard",
                                "title": "Touch Test - IP: )" + WiFi.localIP().toString() + R"(",
                                "actions": [
                                    {
                                        "id": "btn1",
                                        "type": "button",
                                        "label": "Button 1",
                                        "action": "test.button1"
                                    },
                                    {
                                        "id": "btn2",
                                        "type": "button",
                                        "label": "Button 2",
                                        "action": "test.button2"
                                    },
                                    {
                                        "id": "btn3",
                                        "type": "button",
                                        "label": "Button 3",
                                        "action": "test.button3"
                                    }
                                ]
                            }
                        ]
                    }
                })";
                
                if (ddlRenderer.parseDDL(touchTestDDL)) {
                    ddlRenderer.render();
                    Serial.println("[DDL] Embedded touch test DDL rendered successfully");
                } else {
                    Serial.println("[DDL] Failed to parse embedded DDL");
                }
            }
        } else {
            Serial.println("[DDL] DDL renderer initialization failed");
        }
#endif // DISPLAY_NO_LVGL
    } else {
        Serial.println("[DISPLAY] Display initialization failed");
    }
#endif

#ifdef ENABLE_PRINTER_SCANNER
    Serial.println("[BOOT] Initializing Printer/Scanner service...");
    initializePrinterService();
    if (globalPrinterService) {
        Serial.println("[PRINTER] Printer/Scanner service initialized successfully");
        
        #ifdef ENABLE_AWS_IOT
        // Register Alexa handlers for printer/scanner control
        registerPrinterAlexaHandlers();
        #endif
    } else {
        Serial.println("[PRINTER] Printer/Scanner service initialization failed");
    }
#endif

#ifdef ENABLE_BLUETOOTH_DEVICES
#if !defined(DISABLE_BLE_AUDIO_TTS)
    Serial.println("[BOOT] Initializing Bluetooth service...");
    globalBluetoothService = new BluetoothService();
    if (globalBluetoothService && globalBluetoothService->begin()) {
        Serial.println("[BLUETOOTH] Bluetooth service initialized successfully");
    } else {
        Serial.println("[BLUETOOTH] Bluetooth service initialization failed");
        delete globalBluetoothService;
        globalBluetoothService = nullptr;
    }
#endif

#if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
#if !defined(DISABLE_BLE_AUDIO_TTS)
    if (globalBluetoothService) {
        globalBluetoothService->setScanInterval(120000);
        globalBluetoothService->setScanDuration(5);
        globalBluetoothService->setAutoDiscovery(true);
        Serial.printf("[BLUETOOTH] Audio profile BLE scan config: auto=ON interval=%dms duration=%ds freeHeap=%lu\n",
                      globalBluetoothService->getScanInterval(),
                      globalBluetoothService->getScanDuration(),
                      static_cast<unsigned long>(ESP.getFreeHeap()));
    }
#else
    Serial.println("[BLUETOOTH] BLE device service disabled for classic-only audio profile");
#endif

    Serial.println("[BOOT] Initializing Bluetooth Audio/TTS service...");
    globalBluetoothAudioTtsService = new BluetoothAudioTtsService();
    if (globalBluetoothAudioTtsService && globalBluetoothAudioTtsService->begin()) {
        Serial.println("[BLUETOOTH-AUDIO] Bluetooth Audio/TTS service initialized successfully");
    } else {
        Serial.println("[BLUETOOTH-AUDIO] Bluetooth Audio/TTS service initialization failed");
        delete globalBluetoothAudioTtsService;
        globalBluetoothAudioTtsService = nullptr;
    }
#endif
#endif

#ifdef ENABLE_EVENT_SCHEDULER
    Serial.println("[BOOT] Initializing Event Scheduler service...");
    globalEventScheduler = new EventScheduler();
    if (globalEventScheduler && globalEventScheduler->begin()) {
        Serial.println("[SCHEDULER] Event Scheduler service initialized successfully");
#ifdef ENABLE_BLUETOOTH_DEVICES
        globalEventScheduler->setEventExecutor([](const ScheduledEvent& event) -> bool {
            if (!globalBluetoothService) {
                return false;
            }
            if (!event.deviceType.equalsIgnoreCase("bluetooth") && !event.deviceType.equalsIgnoreCase("ble")) {
                return false;
            }
            return globalBluetoothService->controlDevice(event.deviceId, event.action, event.params);
        });
        Serial.println("[SCHEDULER] Bluetooth executor bridge enabled");
#endif
    } else {
        Serial.println("[SCHEDULER] Event Scheduler service initialization failed");
        delete globalEventScheduler;
        globalEventScheduler = nullptr;
    }
#endif

    String advertisedServices = "[BOOT] Advertised services: ";
    bool firstAdvertised = true;
    if (ffsUp) {
        advertisedServices += "FFS";
        firstAdvertised = false;
    }
#ifdef ENABLE_PMACHINE
#ifndef DISABLE_PMACHINE_ROUTES
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "pmachine";
    advertisedServices += ", GenericRouterService";
    firstAdvertised = false;
#endif
#endif
#ifdef ENABLE_CAMERA
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "camera";
    firstAdvertised = false;
#endif
#ifdef ENABLE_PRINTER_SCANNER
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "printer-scanner";
    firstAdvertised = false;
#endif
#ifdef ENABLE_BLUETOOTH_DEVICES
#if !defined(DISABLE_BLE_AUDIO_TTS)
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "BluetoothService";
    firstAdvertised = false;
#endif
#if defined(ENABLE_BLUETOOTH_AUDIO_TTS)
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "BluetoothAudioTtsService";
    firstAdvertised = false;
#endif
#endif
#ifdef ENABLE_EVENT_SCHEDULER
    if (!firstAdvertised) advertisedServices += ", ";
    advertisedServices += "EventScheduler";
    firstAdvertised = false;
#endif
    if (firstAdvertised) advertisedServices += "none";
    Serial.println(advertisedServices);

    // 8. Web server for node name config (Async)
    setupWebServer();
#if defined(ESP32) && !defined(DISABLE_BONECRUSHER)
    startBonecrusherWorkerTaskIfNeeded();
#endif
}

void loop() {
    udpRuntimeMaintainConnectivity(runtimeUdpParentPort, runtimeUdpSiblingPort, WIFI_RECONNECT_INTERVAL);

